// ভাই ব্যাপারটা কি তাহলে এমন যে প্রতিটা ডিক্লারেশন প্রথমে script scope এ জাভাস্ক্রিপ্ট স্টোর করে অতঃপর সেখান থেকে যাকে সম্ভব গ্লোবাল এক্সিকিউশন স্কোপে নিয়ে এক্সিকিউট করে। ফলে var এবং let দুটোই script scope এ আসে,  var pass করে global scope এ যায় কিন্তু let তার strict nature টা মেইনটেইন করতে script scope থেকে আর পাস হয় না। ফলে তখন এক্সিকিউশনে গিয়ে এরর পাই আর সে যে script scope থেকে global scope এ যেতে পারল না বরং ডেড লক হয়ে গেল এটাকে আমরা টেম্পরারি ডেড জোন বলতে পারি



// ggggghgfhhdfa-flip-horizontalhgjbn
//  bn